BL_snapshot_f7134/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
|  \\    /  F ield         | OpenFOAM                                         |
|   \\  /   O peration     |                                                 |
|    \\/    M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector>
100000
(
(0.3970372581 0.05140008065 0)
(0.3970372581 0.05140008065 0)
(0.3970372581 0.05140008065 0)
(0.3970372581 0.05140008065 0)
(0.3970372581 0.05140008065 0)
(0.3970372581 0.05140008065 0)
(0.3970372581 0.05140008065 0)
(0.3970372581 0.05140008065 0)
...
);

boundaryField
{
    surface
    {
        type            fixedShearStress;
        tau             (0.0001 0 0);
        value           uniform (0 0 0);
    }
    seabed
    {
        type            noSlip;
    }
    left
    {
        type            cyclic;
    }
    right
    {
        type            cyclic;
    }
}

// ************************************************************************* //
