BL_snapshot_f7134/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    surface
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          2500;
        startFace       293500;
    }
    seabed
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          2500;
        startFace       296000;
    }
    left
    {
        type            cyclic;
        inGroups        List<word> 1(cyclic);
        nFaces          2000;
        startFace       298500;
        matchTolerance  0.0001;
        neighbourPatch  right;
        transformType   translational;
        separation      (-250 0 0);
    }
    right
    {
        type            cyclic;
        inGroups        List<word> 1(cyclic);
        nFaces          2000;
        startFace       300500;
        matchTolerance  0.0001;
        neighbourPatch  left;
        transformType   translational;
        separation      (250 0 0);
    }
    defaultFaces
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          4000;
        startFace       302500;
    }
)

// ************************************************************************* //
